{"answer": [["My own daughter asked - only two days ago - \"What is physics\"? While that may be a little too simple - there's plenty of definitions easily available - how simple can (or should) we go on this site? ", "I think it would be pretty difficult to create a question that is considered \"too basic\" from every perspective. After all, questions that on the surface look basic often pose much deeper questions. Physics, after all, is about the fundamentals. None other than Einstein spent much of his youth thinking about problems the average person would probably take for granted; and he gave us relativity theory.", "\"What is physics?\" is actually a surprisingly pertinent question. Your average person certainly couldn't answer it well, and some physicists may even struggle to precise about it. \"The study of energy and matter\" is a common answer given, though somehow it doesn't fully justify it. Physics, especially these days, often blurs with mathematics at one end and philosophy at the other, not to mention chemistry and the more obvious ones.", "Why don't we encourage posters to give a little bit of their background and their own thoughts?  That way, we can address answers to an appropriate level, and also remind ourselves that we once had similar \"basic questions\" as well...", "Simple rule: if a satisfactory answer can be provided by a simple Wikipedia query, it is too basic.", "I think something is too basic if a reasonably-informed Google search will turn up a valid answer on the first page.  I often wonder myself if some of my questions are too basic, like my last question:", "Since I wrote that, I discovered that Wikipedia does, in fact address it.  But the thing is, it's not addressed specific to what I had in mind, it's not as expansive or detailed as what I was asking for, and it would be hard for someone looking for it to find.  Because of this, I think there's still a lot of value coming out of my question.  But the question of whether or not something is too basic does occur to me a lot.", "So here is a variant of the question that I think the OP is asking: should this be more like MO level or MSE level? I personally committed on Area51 because I think the physics community should get in on the type of stuff that can happen on an MO type site. I doubt that I will be asking questions on here for very long simply because I expect most of my questions to be too basic. That is the way it should be. Simple questions should be left for another site, except that it took so long to get this beta underway it may be detrimental to the community to turn people away. A lot of people think that MO is a bit snobbish, but they are missing the point, the website is for research level questions only. Or at least something that you might wonder about after qualifiers or some such thing.", "Maybe a better example of a basic question would be the following: \"I don't get free body diagrams, can someone please help?\" I think this should be considered too basic, but I am not even the type of person this place is for so... those are my thoughts.", "PS: MO is Mathoverflow and MSE is Math.stackexchange. ", "@Herb, physics is a natural science which studies processes whereby substances do not undergo change in their identity. For instance, melting ice is a physical process because it dies not change the identity of the substance water. You can go back and forth from water to ice and back without changing the identity of the substance water. You can even turn it into steam and then condense it back into liquid water. Identity is preserved.", "Not so when chemical processes take place. Take for instance paper. You can burn it and what you get are ashes which are of a completely different identity compared to the paper you started with. No need to say that you can't convert ashes back to paper. Thus, chemistry is a natural science which studies processes which lead to change in the identities of substances unlike what happens as a result of physical processes.  ", "linkhttps://physics.stackexchange.com/questions/15678/is-mid-water-bouyancy-a-classic-example-of-a-balanced-but-unstable-system"], ["A small body of mass $m$ slides down from the top of a hemisphere of radius $r$. There is no friction between the surface of the block and the hemisphere. The height at which the body loses contact with the surface of the sphere is?", "\nThis is how I understood the problem:\n", "First of all, the mass does not lose contact with the surface of the sphere at all, considering it is undergoing centripetal acceleration, where the centripetal force is provided by the component of the mass's weight towards the centre of the hemisphere ($mgcos\\theta$, where $\\theta$ is the angle between the vector of the mass's weight and its component acting towards the centre).", "\nTherefore, since only $mgcos\\theta$ is responsible for the centripetal force, I can form a relationship like this:", "\n", "\n$mgcos\\theta\\ =\\ \\large \\frac{mv^2}{r}$", "\n$ v\\ =\\ \\sqrt{rgcos\\theta}$", "\nTaking 'h' as the height of the mass from the base of the hemisphere.", "\n$cos\\theta\\ =\\ \\large \\frac{h}{r}$", "\nThen the velocity of the mass becomes:", "\n$v\\ =\\ \\sqrt{gh}$", "\nThe component of the mass's weight along the centre disappears only when $\\theta$ becomes $90$ degrees. At this point, it leaves the surface of the hemisphere.", "\nNow, the energy of the mass at the topmost point is:", "\n$P.E\\ =\\ mgr$ ", "\nAs the body slides over the hemisphere's surface, it has a tangential velocity given by the expression I had just previously derived. So by the conservation of total mechanical energy of the body, its energy at any other point on the hemisphere is:", "\n$T.E\\ =\\ mgh + \\frac{1}{2}mv^2$", "\n$P.E\\ =\\ T.E$", "\n$gr\\ =\\ gh + \\frac{v^2}{2}$", "\n$gr\\ =\\ gh + \\frac{gh}{2}$", "\n$h\\ =\\ \\frac{2}{3}r$", "\nBut this would mean that the body does indeed leave the surface of the hemisphere. It just doesn't add up. Can someone please explain if my approach and assumptions are valid and how I got to this completely contradictory answer?", "From what I remember $h=\\frac{2r}{3}$ is indeed the corect answer. ", "This the incorrect part of your reasoning.", "From what I understand your saying that at $θ = 90 degrees$ the radial component of the weight is zero therefore the blocks falls off. A non-circular analogy to this would be saying that that gravity always acts downward therefore it is imposible to throw any object, which is of course incorrect. After the block falls of it's weight is still \"pulling\" the block in the radial direction, however the tangental velocity component is too big i.e. $mgcosθ < \\frac{mv^2}{r}$", "For completeness sake it is worth noting that the statement $mgcosθ = \\frac{mv^2}{r}$ isn't true while the block is still on the hemisphere, as you didn't take into account the contact/normal force between the block and the hemisphere. However not including it doesn't matter as the normal force is zero at the moment the blocks leaves the surface.\nSimilarly $cosθ = \\frac{h}{r}$ will only hold when the block is still no the hemisphere", "As the body slides around the hemisphere, it drops lower, from its original height of $r$ to a height of $r-r\\cos\\theta$, where $\\theta$ starts at 90 degrees and drops to 0 degrees (It's analogous to latitude.)", "So the loss of potential energy is equal to the kinetic energy:$\\frac12mv^2=mgr(1-\\cos\\theta)$\nSo $v^2=2gr(1-\\cos\\theta)$", "The inward centripetal force ", " is indeed given by:$F_C=\\frac{mv^2}{r}$so, substituting:$F_C=\\frac{2mgr(1-\\cos\\theta)}{r}=2mg(1-\\cos\\theta)$ The inward centripetal force ", " due to the radial component of gravity is $mg\\cos\\theta$, minus the normal outward force of the surface acting on the block.  When the block \"needs\" all the gravity component, and then more, it leaves the surface (unless the surface can \"suck\"!", "Set the radial component, $mg\\cos\\theta$ (yes, the same $\\theta$) equal to the force needed and solve...", "Work is said to be done when a force applied on the body displaces the body through a certain distance in the direction of force.", "Let a constant force F- be applied on the body such that it makes an angle qwith the horizontal and body is displaced through a distance s", "(i) F cosq  in the direction of displacement of the body.", "(ii) F sinq  in the perpendicular direction of displacement of the body.", "Since body is being displaced in the direction of F cosΘ, therefore work done by the force in displacing the body through a distance s is given by ", "           ", "or w = fs            ", "Thus work done by a force is equal to the scalar or dot product of the force and the displacement of the body.", "Source:", "linkhttp://www.transtutors.com/homework-help/civil-engineering/work-power-and-energy/"], [], ["\"Consider a particle in a central field and assume that the\nsystem has a discrete spectrum.  Each orbital quantum number\n$l$ has a minimum energy value.  Show that this minimum value\nincreases as $l$ increases.\"", "But in their  (Schaum's)  solution they insist on doing it with\nintegrals..", "$\\enclose{horizontalstrike}\n{\\hat{H} = \\dfrac{-\\hbar^2}{2mr^2} \\frac{d}{dr} (r^2 \\frac{d}{dr})\n+ \\dfrac{\\hbar^2}{2m} \\dfrac{l(l+1)}{r^2} + V(r)}$", "$\\enclose{horizontalstrike}\n{\\hat{H_1} = \\dfrac{-\\hbar^2}{2mr^2} \\frac{d}{dr} (r^2 \\frac{d}{dr}) + V(r)}$", "$\\enclose{horizontalstrike}\n{\\hat{H} = \\hat{H_1} + \\dfrac{\\hbar^2}{2m} \\dfrac{l(l+1)}{r^2}}$", "--", "The minimum energy value for $l$ is", "$\\enclose{horizontalstrike}\n{E_l = \\iiint \\Psi_{l}^* (\\hat{H_1}\n+ \\dfrac{\\hbar^2}{2m} \\dfrac{(l)(l+1)}{r^2}) \\Psi_{l}\n\\:\\: dr \\: d\\theta \\: d\\phi}$", "The minimum energy value for $l+1$ is", "$\\enclose{horizontalstrike}\n{E_{l+1} = \\iiint \\Psi_{l+1}^* (\\hat{H_1}\n+ \\dfrac{\\hbar^2}{2m} \\dfrac{(l+1)(l+2)}{r^2}) \\Psi_{l+1}\n\\:\\: dr \\: d\\theta \\: d\\phi}$", "(These $\\Psi_{l}$ and $\\Psi_{l+1}$ apparently encapsulate any possible\nvalue of $n$.)", "--", "By splitting up $\\enclose{horizontalstrike}\n{(l+1)(l+2) = (2l+2) + (l)(l+1)}$,", "$\\enclose{horizontalstrike}\n{E_{l+1} = \\iiint \\Psi_{l+1}^*\n(\\dfrac{\\hbar^2}{2m} \\dfrac{(2l+2)}{r^2}) \\Psi_{l+1}\n\\:\\: dr \\: d\\theta \\: d\\phi} \\\\\n+ \\enclose{horizontalstrike}{\\iiint \\Psi_{l+1}^* (\\hat{H_1}\n+ \\dfrac{\\hbar^2}{2m} \\dfrac{(l)(l+1)}{r^2}) \\Psi_{l+1}\n\\:\\: dr \\: d\\theta \\: d\\phi}$", "The first term is always positive because $\\Psi_{l+1}^* \\Psi_{l+1}$\nis always positive and $(2l+2)$ is always positive.", "Then if we can show that the second term is $\\ge$", "$\\enclose{horizontalstrike}\n{\\iiint \\Psi_{l}^* (\\hat{H_1}\n+ \\dfrac{\\hbar^2}{2m} \\dfrac{(l)(l+1)}{r^2}) \\Psi_{l}\n\\:\\: dr \\: d\\theta \\: d\\phi}$", ", we are done.", "--", "So to show that $\\enclose{horizontalstrike}\n{\\iiint \\Psi_{l+1}^* (\\hat{H_1}\n+ \\dfrac{\\hbar^2}{2m} \\dfrac{(l)(l+1)}{r^2}) \\Psi_{l+1}\n\\:\\: dr \\: d\\theta \\: d\\phi \\ge} \\\\\n\\enclose{horizontalstrike}{\\iiint \\Psi_{l}^* (\\hat{H_1}\n+ \\dfrac{\\hbar^2}{2m} \\dfrac{(l)(l+1)}{r^2}) \\Psi_{l}\n\\:\\: dr \\: d\\theta \\: d\\phi}$", "I split it up into showing that:", "(1)   $\\enclose{horizontalstrike}\n{\\iiint \\Psi_{l+1}^* (\\hat{H_1}) \\Psi_{l+1}\n\\:\\: dr \\: d\\theta \\: d\\phi}\n\\ge \\\\\n\\enclose{horizontalstrike}{\\iiint \\Psi_{l}^* (\\hat{H_1}) \\Psi_{l}\n\\:\\: dr \\: d\\theta \\: d\\phi}$", "and", "(2)    $\\enclose{horizontalstrike}\n{\\iiint \\Psi_{l+1}^*\n(\\dfrac{\\hbar^2}{2m} \\dfrac{(l)(l+1)}{r^2}) \\Psi_{l+1}\n\\:\\: dr \\: d\\theta \\: d\\phi}\n\\ge \\\\\n\\enclose{horizontalstrike}{\\iiint \\Psi_{l}^*\n(\\dfrac{\\hbar^2}{2m} \\dfrac{(l)(l+1)}{r^2}) \\Psi_{l}\n\\:\\: dr \\: d\\theta \\: d\\phi}$", "--", "I rewrite (1) as", "$\\enclose{horizontalstrike}\n{\\iiint R_{l+1}^* Y_{l+1}^* (\\hat{H_1}) R_{l+1} Y_{l+1}\n\\:\\: dr \\: d\\theta \\: d\\phi}\n\\ge \\\\\n\\enclose{horizontalstrike}{\\iiint R_{l}^* Y_{l}^* (\\hat{H_1}) R_l Y_l\n\\:\\: dr \\: d\\theta \\: d\\phi}$", "Since $\\hat{H_1}$ depends only on $r$,", "$\\enclose{horizontalstrike}\n{\\int R_{l+1}^* (\\hat{H_1}) R_{l+1} \\iint Y_{l+1}^* Y_{l+1}\n\\:\\: dr \\: d\\theta \\: d\\phi \\ge}\n\\enclose{horizontalstrike}\n{\\int R_{l}^* (\\hat{H_1}) R_{l} dr \\iint Y_{l}^* Y_{l}\n\\:\\: dr \\: d\\theta \\: d\\phi}$", "Due to normalization,", "$\\enclose{horizontalstrike}\n{\\int R_{l+1}^* (\\hat{H_1}) R_{l+1} \\cdot 1 \\: dr\n\\ge\n\\int R_{l}^* (\\hat{H_1}) R_{l} \\cdot 1 \\: dr}$", "I think the above is true but I'm kind of stuck.", "--", "Going on, I rewrite (2):", "$\\enclose{horizontalstrike}{\\iiint R_{l+1}^* Y_{l+1}^*\n(\\dfrac{\\hbar^2}{2m} \\dfrac{(l)(l+1)}{r^2}) R_{l+1} Y_{l+1}\n\\:\\:dr \\:d\\theta \\:d\\phi\n\\ge\n\\iiint R_{l}^* Y_{l}^*\n(\\dfrac{\\hbar^2}{2m} \\dfrac{(l)(l+1)}{r^2}) R_{l} Y_{l}\n\\:\\:dr \\:d\\theta \\:d\\phi}$", "and through a similar argument about normalization of $Y$", "$\\enclose{horizontalstrike}\n{\\int R_{l+1}^* (\\dfrac{\\hbar^2}{2m} \\dfrac{(l)(l+1)}{r^2})\nR_{l+1} \\:dr\n\\:\\ge\\:\n\\int R_{l}^* (\\dfrac{\\hbar^2}{2m} \\dfrac{(l)(l+1)}{r^2})\nR_{l} \\:dr}$", "which again seems to be fair, but I'm stuck.", "Would you please help me finish the proof?", "--", "(aug.29,2015)", "Their solution:", "Start by defining", "$E_{min.}^{l_0} \\equiv \nmin_{l=l_0}\n( \\iiint \\Psi_{l_0}^* [\\hat{H_1} + \\dfrac {\\hbar^2}{2m}\n \\dfrac {l_0(l_0+1)}{r^2}] \\Psi_{l_0} \\:dr\\:d\\theta\\:d\\phi )$", "where $l_0$ is just some fixed value for $l$, for example 3.", "So we have defined $E_{min.}^{l_0}$ to be  \"out of all the\npossible wave functions with $l=l_0$, pick the one with the\nlowest energy, calculate the displayed integral, and let\nthat scalar value be known as $E_{min.}^{l_0}$.\"", "Then compare to this expression:", "$\\iiint \\Psi_{l_0+1}^* [\\hat{H_1} + \\dfrac {\\hbar^2}{2m}\n \\dfrac {l_0(l_0+1)}{r^2}] \\Psi_{l_0+1} \\:dr\\:d\\theta\\:d\\phi$", "(i.e., the same expression but just with now we are letting\nthe wave function be any wave function with orbital quantum\nnumber  $l_0+1$ instead of $l_0$.)", "They say that  \"The minimum eigenvalue of the Hamiltonian\n$\\hat{H} = \\hat{H_1} + \\dfrac {\\hbar^2}{2m}\n \\dfrac {l_0(l_0+1)}{r^2}$  corresponds to the eigenfunction\n $\\Psi_{l_0}$.  Thus, the second expression $> E_{min.}^{l_0}$.\"\nWhich would complete the proof, but I interject-", "Certainly the operator $\\hat{H} = \\hat{H_1} + \\dfrac {\\hbar^2}{2m}\n \\dfrac {l_0(l_0+1)}{r^2}$ is not the Hamiltonian for a wave\nfunction with orbital number $(l_0+1)$.  So why couldn't that\noperator, when operating on $\\Psi_{l_0+1}$  in the triple integral\nexpression, produce some  \"New, Small\"  wave function $\\Psi_{New,Small}$\nsuch that", "$\\iiint \\Psi_{l_0+1}^* \\Psi_{New,Small}  \\:dr\\:d\\theta\\:d\\phi$", "actually drops below $E_{min.}^{l_0}$?", "Not a proof but:", "Because the potential only depends on $r$, it can be shown\nthat the wave function is separable into $\\Psi=RY$.\n(This might be shown by David Miller in his online\nquantum mechanics course at Stanford in his lectures\nin section 7 on the hydrogen atom.)", "Then we can say that the $Y(\\theta,\\phi)$ portion is\nthe spherical harmonics, same as for the hydrogen atom.\n(This just arises out of the form of the 3-d Laplacian:\nwhen you separate the equation and apply the Hamiltonian\nthis is just what the solutions that you get are.)", "Now the spherical harmonics have eigenvalues $\\sqrt{(l)(l+1)}$\nin the Hamiltonian.  What this is saying is that the\nspherical harmonics, the more kinky they get\n(higher frequency oscillation as you go around the sphere)\nthe bigger the eigenvalue, which translates  (when you're\ntalking about the Hamiltonian)  into monotonically\nstrictly greater energy.", "So this gives an idea of why\nthe radial portion  \"doesn't matter.\"  Whatever that\nminimal energy radial function looks like, it's treated\nseparately from the angular portion  (thanks to\nseparability of the wave function)  and does its own\ncontribution to the energy  (via the Hamiltonian)\nand so we only need to look at the angular portion of\nthe Hamiltonian to judge whether or not an increase\nin $l$ will lead to strictly greater energy."]], "domain": ["Stack Exchange", "Stack Exchange", "Stack Exchange", "Stack Exchange"], "success": 1}