{"answer": [["", "Organic molecules are molecules consist of carbons. Hydrocarbons are organic molecules, which consist of only carbon and hydrogen atoms. Hydrocarbons can be aromatic or aliphatic. They are mainly divided into few types as alkanes, alkenes, alkynes, cycloalkanes and aromatic hydrocarbons. Hexane and n-hexane are alkanes or otherwise, known as saturated hydrocarbons. They have the highest number of hydrogen atoms, which a molecule can accommodate. All the bonds between carbon atoms and hydrogens are single bonds. Because of that, the bond rotation is allowed between any atoms. They are the simplest type of hydrocarbons. Saturated hydrocarbons have the general formula of CnH2n+2. These conditions slightly differ for the cycloalkanes because they have cyclic structures. ", "Butane ", "As stated above, butane hydrocarbon is a saturated alkane. It has four carbon atoms; therefore, has the molecular formula of C4H10. Molar mass of butane is 58.12 g mol−1. Melting point of butane is 133-139 K, and the boiling point is 272-274 K. Butane is the common name used to indicate all the molecules with this formula. There are two structural isomers that we can draw to match this formula but, in IUPAC nomenclature, we use butane specifically to indicate unbranched molecule, which is also known as n-butane. It has the following structure. ", " ", " ", "Other structural isomer is like methylated molecule of propane. It is known as isobutane. Butane is a colorless gas. It can be easily liquefied. The butane gas is highly flammable. Butane is a component of natural gas, and it is produced when gasoline is refined. Upon complete combustion, butane produces carbon dioxide and water. However, if there isn’t enough oxygen gas for the combustion, it produces carbon monoxide and water from partial combustion. Butane is used as a fuel. When producing LP gas, butane is mixed with propane and other hydrocarbons. These are used for cooking purposes at household. It is also used in lighters. ", "Isobutane ", "Isobutane is a structural isomer of butane. It has the same molecular formula as butane, but the structural formula is different. It is also known as methylpropane. It has the following structure. ", " ", "Isobutane has a tertiary carbon, and it is the simplest molecule with a tertiary carbon. Isobutane is a colorless, odorless, transparent gas. Melting point of isobutane is 40-240 K, and the boiling point is 260-264 K. It is mainly used as a refrigerant. Pure form of isobutane is used in refrigerators. Further, it is used as a propellant in aerosol sprays. ", " "], ["", "In organic chemistry, butyl is a four-carbon alkyl radical or substituent group with general chemical formula −C4H9, derived from either of the two isomers of butane. ", "The isomer n-butane can connect in two ways, giving rise to two \"-butyl\" groups: ", "If it connects at one of the two terminal carbon atoms, it is normal butyl or n-butyl: CH3−CH2−CH2−CH2− (fully systematic name: butyl) ", "If it connects at one of the non-terminal (internal) carbon atoms, it is secondary butyl or sec-butyl: CH3−CH2−CH(CH3)− (fully systematic name: 1-methylpropyl) ", "The second isomer of butane, isobutane, can also connect in two ways, giving rise to two additional groups: ", "If it connects at one of the three terminal carbons, it is isobutyl: (CH3)2CH−CH2− (fully systematic name: 2-methylpropyl) ", "If it connects at the central carbon, it is tertiary butyl, tert-butyl or t-butyl: (CH3)3C− (fully systematic name: 1,1-dimethylethyl "], ["", "i hope it help you ", "We find that n-butane and iso-butane have the same molecular formula (C4H10) but they have different structures . They are called as Isomers. In other words, the organic compounds having the same molecular formula but different arrangement of carbon atoms in them are called as Isomers. ", "mark me as brainliest answer ", "", "These are called isomers bcoz these have different structural formula but their name is same.These compounds can be represented in different in two or three structures that is n(straight line), iso(perpendicular), neo(plus). ", "HOPE THIS HELPS YOU. ", "PLZ FOLLOW ME. "], ["", "they are not isomers. ", "but they are in homologous series. ", "CnH2n+2 ", "", "i hope it help you ", "We find that n-butane and iso-butane have the same molecular formula (C4H10) but they have different structures . They are called as Isomers. In other words, the organic compounds having the same molecular formula but different arrangement of carbon atoms in them are called as Isomers. ", "mark me as brainliest answer "], ["The answer for ur question is above", "Pls mark me as the brainliest answer ", "HOPE IT HELPS YOU", "linkhttps://hi-static.z-dn.net/files/d85/19a8f2cb212c051e2ce35f74c7e79819.jpg"]], "domain": ["brainly", "brainly", "brainly", "brainly", "brainly"], "success": 1}