{"answer": [["I saw ", ", but it's not quite what I'm asking.", "A bell makes a sound. How would you write that sound in English? As an interjection, e.g. \"boom!\"", "I'm sure it varies with the type and size of bell. I'd be happy to hear any and all variations.", " – the sound that a bell makes when it rings\n", " – a long deep sound that a bell makes\n", " – a ringing sound made by a bell, or by a clock with a bell inside it\n", " – the short sound that a bell makes\n", " – the sound that a bell makes\n", " – the sound that small metal objects make when they hit each other\n", " – a sound of several bells ringing\n", " – a short high sound like the sound of a small bell\n", " – the sound that a bell produces\n", " – a sound like a bell\n", " – the high clear sound that a small bell makes\n", " – a high ringing sound\n", " – the sound of bells\n", " – a warning signal made by the sound of a bell\n", " – the loud slow repeated sound of a large bell\n", "—", "The sound of Big Ben over the radio was traditionally rendered \"Bong\" (and sometimes referred to as ", ", though I wouldn't recommend that in a normal context). ", "Church bells are supposed to go \"Ding-dong\" when rung, e.g., for a wedding. I have seen the sound of a full peal rendered \"Tin-tan-din-dan-bim-bam-bom-bo\" (Dorothy Sayers, if I remember correctly), but, again, would hesitate to use that more generally. ", "The problem is that ", " is no more specific than ", ", so just as people may whisper, murmur, exclaim, shout or many other possibilities, bells may tinkle, chime, peal, clamour, clang..., and each would be 'spelt out' differently. ", "As stated by the others, depends on the size of the bell. Actually, if you want a wide variety of sounds, look up the song, \"Carol of the Bells\". By the by, I've seen the occasional case of someone seeing that bells go \"Ding dong\" and including the latter, but you'll generally reduce the reader to laughter if there's a sudden DONG! in your narrative. ^_^ It's got to do with a certain slang use of it.", "Oh, and because it's too good to pass up, the sound of the bells is something described as \"tintinnabulation\", especially in Edgar Allen Poe's ", ".", "Not an answer, just an addendum to @TimLymington's answer - I agree with Ding-Dong", "linkhttps://english.stackexchange.com/questions/41418/how-do-you-call-the-sound-of-a-bell", "linkhttp://www.macmillandictionary.com/thesaurus-category/american/Ringing-sounds", "linkhttp://en.wikipedia.org/wiki/The_Nine_Tailors"]], "domain": ["Stack Exchange"], "success": 1}